tests/performance/load-tests/browse-and-order.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load - 50 concurrent users"
    - duration: 60
      arrivalRate: 100
      name: "Peak load - 100 concurrent users"
  processor: "./test-helpers.js"
  plugins:
    metrics-by-endpoint:
      stripQueryString: true
  ensure:
    maxErrorRate: 1
    p95: 500
    p99: 1000

scenarios:
  - name: "Browse Products"
    weight: 60
    flow:
      - get:
          url: "/api/v1/products"
          capture:
            - json: "$.products[0].id"
              as: "productId"
      - think: 2
      - get:
          url: "/api/v1/products/{{ productId }}"
      - think: 1
      - get:
          url: "/api/v1/products?category=Electronics"

  - name: "User Registration and Login"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "test{{ $randomString() }}@example.com"
            password: "Test@1234"
            firstName: "Load"
            lastName: "Test"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - get:
          url: "/api/v1/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Place Order"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "loadtest@example.com"
            password: "Test@1234"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
      - get:
          url: "/api/v1/products"
          capture:
            - json: "$.products[0].id"
              as: "productId"
            - json: "$.products[0].price"
              as: "productPrice"
      - think: 3
      - post:
          url: "/api/v1/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            userId: "{{ userId }}"
            items:
              - productId: "{{ productId }}"
                quantity: 1
                price: "{{ productPrice }}"
            shippingAddress:
              street: "123 Load Test St"
              city: "Test City"
              state: "TS"
              zip: "12345"
              country: "Test Country"